app/controllers/api/v1/pets_controller.rb

SELECT "pets".* FROM "pets"
---
  def index
    pets = Pet.all

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    pet = Pet.find(params[:id])

INSERT INTO "pets" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "toto"], ["created_at", "2015-08-30 10:27:29.558103"], ["updated_at", "2015-08-30 10:27:29.558103"]]
---
  def create
    pet = Pet.new(pet_params)
    if pet.save

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", 5]]
---
  def update
    pet = Pet.find(params[:id])